zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_rcc_ex.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL Extended  module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP2xx_HAL_RCC_EX_H
#define STM32MP2xx_HAL_RCC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_def.h"

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @addtogroup RCCEx
  * @{
  */

/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_RCC_BootCx RCC BootCx
  * @{
  */
#define RCC_BOOT_C1                     RCC_STBYBOOTCR_CPU1_HW_BEN
#define RCC_BOOT_C2                     RCC_STBYBOOTCR_CPU2_HW_BEN

#define IS_RCC_BOOT_CORE(CORE)          (((CORE) == RCC_BOOT_C1)  || \
                                         ((CORE) == RCC_BOOT_C2)  || \
                                         ((CORE) == (RCC_BOOT_C1 | RCC_BOOT_C2) ))

/**
  * @}
  */

/** @defgroup RCCEx_RCC_XBar RCC XBar Div
  * @{
  */
#define RCC_XBAR_DIV_POS1       1UL
#define RCC_XBAR_DIV_POS2       2UL
#define RCC_XBAR_DIV_POS4       4UL
#define RCC_XBAR_DIV_POS64      64UL
#define RCC_XBAR_DIV_POS128     128UL
#define RCC_XBAR_DIV_POS256     256UL
#define RCC_XBAR_DIV_POS1024    1024UL
#define RCC_XBAR_DIV_POS65536   65536UL

#define IS_RCC_XBARDIV(__DIV__) ((((__DIV__) >= RCC_XBAR_DIV_POS1)    && ((__DIV__) <=    RCC_XBAR_DIV_POS64)) || \
                                 (((__DIV__) >= RCC_XBAR_DIV_POS2)    && ((__DIV__) <=   RCC_XBAR_DIV_POS128)  && \
                                  (((__DIV__) %    RCC_XBAR_DIV_POS2) == 0UL)) || \
                                 (((__DIV__) >= RCC_XBAR_DIV_POS4)    && ((__DIV__) <=   RCC_XBAR_DIV_POS256)  && \
                                  (((__DIV__) %    RCC_XBAR_DIV_POS4) == 0UL)) || \
                                 (((__DIV__) >= RCC_XBAR_DIV_POS1024) && ((__DIV__) <= RCC_XBAR_DIV_POS65536) && \
                                  (((__DIV__) % RCC_XBAR_DIV_POS1024) == 0UL)))
#if defined(RCC_D3DCR_D3PERCKSEL)
#define IS_RCC_D3_SOURCE(SOURCE) (((SOURCE) == RCC_D3SOURCE_MSI) || ((SOURCE) == RCC_D3SOURCE_LSI) || \
                                  ((SOURCE) == RCC_D3SOURCE_LSE))
#endif /* RCC_D3DCR_D3PERCKSEL */
/**
  * @}
  */

#if defined(CORE_CA35)
/* CA35SS Clock Lock time outs */
#define PLL1_LOCK_TIMEOUT_VALUE    (2U)    /* 2 ms (minimum Tick + 1) but real lock time is less than one tick */
#define CHGCLK_TIMEOUT_VALUE       (2U)    /* 2 ms (minimum Tick + 1) but real lock time is less than one tick */

#define SSCG_ON                   0x1U
#define FRAC_ON                   0x1U
#define A35_SOURCE_PLL1           0x0U
#define A35_SOURCE_EXT            0x1U
#endif /* CORE_CA35 */

/** @defgroup RCC_PLL_State  RCC PLL State
  * @{
  */
#define RCC_PLL_OFF                  0x00000000U
#define RCC_PLL_ON                   0x00000001U

/**
  * @}
  */

/** @defgroup RCC_PLL_Mode  RCC PLL Mode
  * @{
  */
#define RCC_PLL_SPREAD_SPECTRUM 0x01U
/**
  * @}
  */

/** @defgroup RCC_PLL_Spread_Spectrum_Mode  RCC PLL Spread Spectrum mode
  * @{
  */
#define RCC_PLL_CENTERSPREAD    0x00U
#define RCC_PLL_DOWNSPREAD      0x01U
/**
  * @}
  */

/** @defgroup RCC_PLL_Clock_Source  RCC PLL Clock Source
  * @{
  */
#define RCC_PLLSOURCE_HSI       0x00000000U
#define RCC_PLLSOURCE_HSE       0x00000001U
#define RCC_PLLSOURCE_MSI       0x00000002U
/**
  * @}
  */
#if defined(RCC_D3DCR_D3PERCKSEL)
/** @defgroup RCC_D3_Clock_Source  RCC D3 Clock Source
  * @{
  */
#define RCC_D3SOURCE_MSI       0x00000000U
#define RCC_D3SOURCE_LSI       RCC_D3DCR_D3PERCKSEL_0
#define RCC_D3SOURCE_LSE       RCC_D3DCR_D3PERCKSEL_1
/**
  * @}
  */
#endif /* RCC_D3DCR_D3PERCKSEL */
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Types RCCEx Exported Types
  * @{
  */

/**
  * @brief  RCC PLL configuration structure definition
  */
typedef struct
{
  uint32_t id;          /*!< The PLL id from 2 to 8       */
  uint32_t PLLSource;   /*!< The new source of the PLL.
                            This parameter can be a value of @ref RCC_PLL_Clock_Source                */
  uint8_t  PLLState;    /*!< The new state of the PLL.
                            This parameter can be a value of @ref RCC_PLL_State                       */
  uint8_t  PLLMode;     /*!< The new state of the PLL.
                            This parameter can be a value of @ref RCC_PLL_Mode                        */
  uint8_t  FREFDIV;
  uint16_t FBDIV;
  uint32_t FRACIN;
  uint32_t POSTDIV1;
  uint32_t POSTDIV2;
  uint32_t SSM_Mode;     /*!< The new state of the PLL.
                            This parameter can be a value of @ref RCC_PLL_Spread_Spectrum_Mode        */

  uint32_t SSM_SPREAD;
  uint32_t SSM_DIVVAL;
} RCC_PLLInitTypeDef;

#define RCC_PeriphCLKInitTypeDef        RCC_FlexgenTypeDef


/**
  * @brief Clock observer structure definition.
  */
typedef struct
{
  uint32_t      Enable;         /*!< To enable or disable the observer */
  uint32_t      RCC_MCOx;       /*!< To select the MCO instance */
  uint32_t      RCC_MCOSource;  /*!< To select the MCO source */
  uint32_t      RCC_MCODiv;     /*!< To select the MCO division factor */
  uint32_t      ObsDiv;         /*!< To select the observer division factor */
  uint32_t      ObsInv;         /*!< To select the observer inversion */
  uint32_t      ObsType;        /*!< To select oscillator or flexgen observation */
  uint32_t      ClockType;      /*!< To select the internal or external clock */
} RCC_ObserverTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

