zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc_ex.h
/** @defgroup RCCEx_FrequencyCalculator_ReferenceClockSelection  RCCEx FCALC Reference Clock Selection
  * @{
  */
#define RCC_FCALC_PLL4REFCLOCK       0U
#define RCC_FCALC_PLL5REFCLOCK       1U
#define RCC_FCALC_PLL6REFCLOCK       2U
#define RCC_FCALC_PLL7REFCLOCK       3U
#define RCC_FCALC_PLL8REFCLOCK       4U
/**
  * @}
  */

/** @defgroup RCCEx_FrequencyCalculator_ObservationClockSelection  RCCEx FCALC Observation Clock Selection
  * @{
  */
#define RCC_FCALC_INTOBSCLK_HSI_CK          0x000U
#define RCC_FCALC_INTOBSCLK_HSE_CK          0x001U
#define RCC_FCALC_INTOBSCLK_MSI_CK          0x002U

#if defined(RCC_PLL3CFGR1_PLLEN)
#define RCC_FCALC_INTOBSCLK_PLL4REF_CK      0x005U
#define RCC_FCALC_INTOBSCLK_PLL5REF_CK      0x006U
#define RCC_FCALC_INTOBSCLK_PLL6REF_CK      0x007U
#define RCC_FCALC_INTOBSCLK_PLL7REF_CK      0x008U
#define RCC_FCALC_INTOBSCLK_PLL8REF_CK      0x009U
#define RCC_FCALC_INTOBSCLK_PLL1REF_CK      0x00AU
#define RCC_FCALC_INTOBSCLK_PLL2REF_CK      0x00BU
#define RCC_FCALC_INTOBSCLK_PLL3REF_CK      0x00CU
#else
#define RCC_FCALC_INTOBSCLK_PLL4REF_CK      0x006U
#define RCC_FCALC_INTOBSCLK_PLL5REF_CK      0x007U
#define RCC_FCALC_INTOBSCLK_PLL6REF_CK      0x008U
#define RCC_FCALC_INTOBSCLK_PLL7REF_CK      0x009U
#define RCC_FCALC_INTOBSCLK_PLL8REF_CK      0x00AU
#define RCC_FCALC_INTOBSCLK_PLL1REF_CK      0x00BU
#define RCC_FCALC_INTOBSCLK_PLL2REF_CK      0x00CU
#endif /* RCC_PLL3CFGR1_PLLEN */

#define RCC_FCALC_INTOBSCLK_PLL4OUT_CK      0x040U
#define RCC_FCALC_INTOBSCLK_PLL5OUT_CK      0x041U
#define RCC_FCALC_INTOBSCLK_PLL6OUT_CK      0x042U
#define RCC_FCALC_INTOBSCLK_PLL7OUT_CK      0x043U
#define RCC_FCALC_INTOBSCLK_PLL8OUT_CK      0x044U

#define RCC_FCALC_INTOBSCLK_HSI_KER_CK      0x080U
#define RCC_FCALC_INTOBSCLK_HSE_KER_CK      0x081U
#define RCC_FCALC_INTOBSCLK_MSI_KER_CK      0x082U
#define RCC_FCALC_INTOBSCLK_SPDIF_SYMB_CK   0x083U
#define RCC_FCALC_INTOBSCLK_I2S_CK          0x084U
#define RCC_FCALC_INTOBSCLK_LSI_CK          0x085U
#define RCC_FCALC_INTOBSCLK_LSE_CK          0x086U
#define RCC_FCALC_INTOBSCLK_CK_XBAR_FSM     0x087U
#define RCC_FCALC_INTOBSCLK_CK_ICN_P_RCC    0x088U

#define RCC_FCALC_INTOBSCLK_FINDDIV0        0x0C0U
#define RCC_FCALC_INTOBSCLK_FINDDIV1        0x0C1U
#define RCC_FCALC_INTOBSCLK_FINDDIV2        0x0C2U
#define RCC_FCALC_INTOBSCLK_FINDDIV3        0x0C3U
#define RCC_FCALC_INTOBSCLK_FINDDIV4        0x0C4U
#define RCC_FCALC_INTOBSCLK_FINDDIV5        0x0C5U
#define RCC_FCALC_INTOBSCLK_FINDDIV6        0x0C6U
#define RCC_FCALC_INTOBSCLK_FINDDIV7        0x0C7U
#define RCC_FCALC_INTOBSCLK_FINDDIV8        0x0C8U
#define RCC_FCALC_INTOBSCLK_FINDDIV9        0x0C9U
#define RCC_FCALC_INTOBSCLK_FINDDIV10       0x0CAU
#define RCC_FCALC_INTOBSCLK_FINDDIV11       0x0CBU
#define RCC_FCALC_INTOBSCLK_FINDDIV12       0x0CCU
#define RCC_FCALC_INTOBSCLK_FINDDIV13       0x0CDU
#define RCC_FCALC_INTOBSCLK_FINDDIV14       0x0CEU
#define RCC_FCALC_INTOBSCLK_FINDDIV15       0x0CFU
#define RCC_FCALC_INTOBSCLK_FINDDIV16       0x0D0U
#define RCC_FCALC_INTOBSCLK_FINDDIV17       0x0D1U
#define RCC_FCALC_INTOBSCLK_FINDDIV18       0x0D2U
#define RCC_FCALC_INTOBSCLK_FINDDIV19       0x0D3U
#define RCC_FCALC_INTOBSCLK_FINDDIV20       0x0D4U
#define RCC_FCALC_INTOBSCLK_FINDDIV21       0x0D5U
#define RCC_FCALC_INTOBSCLK_FINDDIV22       0x0D6U
#define RCC_FCALC_INTOBSCLK_FINDDIV23       0x0D7U
#define RCC_FCALC_INTOBSCLK_FINDDIV24       0x0D8U
#define RCC_FCALC_INTOBSCLK_FINDDIV25       0x0D9U
#define RCC_FCALC_INTOBSCLK_FINDDIV26       0x0DAU
#define RCC_FCALC_INTOBSCLK_FINDDIV27       0x0DBU
#define RCC_FCALC_INTOBSCLK_FINDDIV28       0x0DCU
#define RCC_FCALC_INTOBSCLK_FINDDIV29       0x0DDU
#define RCC_FCALC_INTOBSCLK_FINDDIV30       0x0DEU
#define RCC_FCALC_INTOBSCLK_FINDDIV31       0x0DFU
#define RCC_FCALC_INTOBSCLK_FINDDIV32       0x0E0U
#define RCC_FCALC_INTOBSCLK_FINDDIV33       0x0E1U
#define RCC_FCALC_INTOBSCLK_FINDDIV34       0x0E2U
#define RCC_FCALC_INTOBSCLK_FINDDIV35       0x0E3U
#define RCC_FCALC_INTOBSCLK_FINDDIV36       0x0E4U
#define RCC_FCALC_INTOBSCLK_FINDDIV37       0x0E5U
#define RCC_FCALC_INTOBSCLK_FINDDIV38       0x0E6U
#define RCC_FCALC_INTOBSCLK_FINDDIV39       0x0E7U
#define RCC_FCALC_INTOBSCLK_FINDDIV40       0x0E8U
#define RCC_FCALC_INTOBSCLK_FINDDIV41       0x0E9U
#define RCC_FCALC_INTOBSCLK_FINDDIV42       0x0EAU
#define RCC_FCALC_INTOBSCLK_FINDDIV43       0x0EBU
#define RCC_FCALC_INTOBSCLK_FINDDIV44       0x0ECU
#define RCC_FCALC_INTOBSCLK_FINDDIV45       0x0EDU
#define RCC_FCALC_INTOBSCLK_FINDDIV46       0x0EEU
#define RCC_FCALC_INTOBSCLK_FINDDIV47       0x0EFU
#define RCC_FCALC_INTOBSCLK_FINDDIV48       0x0F0U
#define RCC_FCALC_INTOBSCLK_FINDDIV49       0x0F1U
#define RCC_FCALC_INTOBSCLK_FINDDIV50       0x0F2U
#define RCC_FCALC_INTOBSCLK_FINDDIV51       0x0F3U
#define RCC_FCALC_INTOBSCLK_FINDDIV52       0x0F4U
#define RCC_FCALC_INTOBSCLK_FINDDIV53       0x0F5U
#define RCC_FCALC_INTOBSCLK_FINDDIV54       0x0F6U
#define RCC_FCALC_INTOBSCLK_FINDDIV55       0x0F7U
#define RCC_FCALC_INTOBSCLK_FINDDIV56       0x0F8U
#define RCC_FCALC_INTOBSCLK_FINDDIV57       0x0F9U
#define RCC_FCALC_INTOBSCLK_FINDDIV58       0x0FAU
#define RCC_FCALC_INTOBSCLK_FINDDIV59       0x0FBU
#define RCC_FCALC_INTOBSCLK_FINDDIV60       0x0FCU
#define RCC_FCALC_INTOBSCLK_FINDDIV61       0x0FDU
#define RCC_FCALC_INTOBSCLK_FINDDIV62       0x0FEU
#define RCC_FCALC_INTOBSCLK_FINDDIV63       0x0FFU

#define RCC_FCALC_EXTOBSCLK_PLL1DIV42       0x100U
#define RCC_FCALC_EXTOBSCLK_PLL2DIV4        0x101U
#if defined(RCC_PLL3CFGR1_PLLEN)
#define RCC_FCALC_EXTOBSCLK_PLL3DIV2        0x102U
#endif /* RCC_PLL3CFGR1_PLLEN */
#define RCC_FCALC_EXTOBSCLK_USB2PHY1PLL     0x103U
#define RCC_FCALC_EXTOBSCLK_USB2PHY2PLL     0x104U
#define RCC_FCALC_EXTOBSCLK_USB3PCIEPHYPLL  0x105U
#define RCC_FCALC_EXTOBSCLK_LVDSPHYPLL      0x106U
#define RCC_FCALC_EXTOBSCLK_DSIPHYPLL       0x107U
/**
  * @}
  */
/**
  * @}
  */
/* Exported macros -----------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Macros RCCEx Exported Macros
  * @{
  */
/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCCEx_Exported_Functions RCCEx Exported Functions
  * @{
  */

/** @addtogroup RCCEx_Exported_Functions_Group1
  * @{
  */

HAL_StatusTypeDef HAL_RCCEx_PeriphCLKConfig(const RCC_PeriphCLKInitTypeDef  *pPeriphClkInit);
void              HAL_RCCEx_GetPeriphCLKConfig(RCC_PeriphCLKInitTypeDef  *pPeriphClkInit);
uint32_t          HAL_RCCEx_GetPeriphCLKFreq(uint32_t PeriphClk);
uint32_t          HAL_RCCEx_GetTimerCLKFreq(uint32_t TimerId);

