zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_rcc_ex.h
#if defined(CORE_CA35)
HAL_StatusTypeDef HAL_RCCEx_CA35SS_SetCA35SSClockSource(uint32_t source);
HAL_StatusTypeDef HAL_RCCEx_CA35SS_GetCA35SSClockSource(uint32_t *source);
#endif /* CORE_CA35 */

HAL_StatusTypeDef HAL_RCCEx_SetD3ClockSource(uint32_t source);
uint32_t HAL_RCCEx_GetD3ClockSource(void);

#if defined(CORE_CA35)
HAL_StatusTypeDef HAL_RCCEx_CA35SS_PLL1Config(const RCC_PLLInitTypeDef *pll_config);
#endif /* CORE_CA35 */
HAL_StatusTypeDef HAL_RCCEx_PLL2Config(RCC_PLLInitTypeDef *pll_config);
#if defined(RCC_PLL3CFGR1_PLLEN)
HAL_StatusTypeDef HAL_RCCEx_PLL3Config(RCC_PLLInitTypeDef *pll_config);
#endif /* RCC_PLL3CFGR1_PLLEN */
HAL_StatusTypeDef HAL_RCCEx_PLL4Config(RCC_PLLInitTypeDef *pll_config);
HAL_StatusTypeDef HAL_RCCEx_PLL5Config(RCC_PLLInitTypeDef *pll_config);
HAL_StatusTypeDef HAL_RCCEx_PLL6Config(RCC_PLLInitTypeDef *pll_config);
HAL_StatusTypeDef HAL_RCCEx_PLL7Config(RCC_PLLInitTypeDef *pll_config);
HAL_StatusTypeDef HAL_RCCEx_PLL8Config(RCC_PLLInitTypeDef *pll_config);

#if defined(CORE_CA35)
void              HAL_RCCEx_CA35SS_GetPLL1Config(RCC_PLLInitTypeDef *pll_config);
#endif /* CORE_CA35 */
void              HAL_RCCEx_GetPLL2Config(RCC_PLLInitTypeDef  *pll_config);
#if defined(RCC_PLL3CFGR1_PLLEN)
void              HAL_RCCEx_GetPLL3Config(RCC_PLLInitTypeDef  *pll_config);
#endif /* RCC_PLL3CFGR1_PLLEN */
void              HAL_RCCEx_GetPLL4Config(RCC_PLLInitTypeDef  *pll_config);
void              HAL_RCCEx_GetPLL5Config(RCC_PLLInitTypeDef  *pll_config);
void              HAL_RCCEx_GetPLL6Config(RCC_PLLInitTypeDef  *pll_config);
void              HAL_RCCEx_GetPLL7Config(RCC_PLLInitTypeDef  *pll_config);
void              HAL_RCCEx_GetPLL8Config(RCC_PLLInitTypeDef  *pll_config);

#if defined(CORE_CA35)
uint32_t          HAL_RCCEx_CA35SS_GetPLL1ClockFreq(void);
#endif /* CORE_CA35 */
uint32_t          HAL_RCCEx_GetPLL2ClockFreq(void);
#if defined(RCC_PLL3CFGR1_PLLEN)
uint32_t          HAL_RCCEx_GetPLL3ClockFreq(void);
#endif /* RCC_PLL3CFGR1_PLLEN */
uint32_t          HAL_RCCEx_GetPLL4ClockFreq(void);
uint32_t          HAL_RCCEx_GetPLL5ClockFreq(void);
uint32_t          HAL_RCCEx_GetPLL6ClockFreq(void);
uint32_t          HAL_RCCEx_GetPLL7ClockFreq(void);
uint32_t          HAL_RCCEx_GetPLL8ClockFreq(void);

int32_t HAL_RCCEx_MeasureClockFreq(uint32_t clk_id, uint32_t ref_id, uint32_t *freq);

#if defined(CORE_CA35)
void HAL_RCCEx_EnableBootCore(uint32_t RCC_BootCx);
void HAL_RCCEx_DisableBootCore(uint32_t RCC_BootCx);
void HAL_RCCEx_HoldBootMCU(void);
void HAL_RCCEx_BootMCU(void);
#endif /* CORE_CA35 */
/**
  * @}
  */

/** @addtogroup RCCEx_Exported_Functions_Group2
  * @{
  */

HAL_StatusTypeDef HAL_RCCEx_EnableLSECSS(void);
HAL_StatusTypeDef HAL_RCCEx_DisableLSECSS(void);
void              HAL_RCCEx_EnableHSECSS(void);
void              HAL_RCCEx_DisableHSECSS(void);
void              HAL_RCCEx_LSECSS_IRQHandler(void);
void              HAL_RCCEx_LSECSS_Callback(void);
void              HAL_RCCEx_ConfigureClockObserver(uint32_t PeriphClk, RCC_ObserverTypeDef *OBSConf);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_HAL_RCC_EX_H */
